Repository: allegro-systems/site
Catalog: Localizable.xcstrings
Source language: en
Languages: de, es, fr, it, ru

# about.avoid.autoplay
source: Unsolicited autoplay
de: Unaufgeforderte Autoplay
es: Reproducción automática no solicitada
fr: Lecture automatique non sollicitée
it: Autoplay non richiesto
ru: Навязчивое автовоспроизведение

# about.avoid.deepnav
source: Deep navigation
de: Tiefe Navigation
es: Navegación profunda
fr: Navigation profonde
it: Navigazione profonda
ru: Глубокая навигация

# about.avoid.modal
source: Modal interruptions
de: Modale Unterbrechungen
es: Interrupciones modales
fr: Interruptions modales
it: Interruzioni modali
ru: Модальные прерывания

# about.avoid.motion
source: Excessive Decorative motion
de: Übermäßige dekorative Bewegung
es: Movimiento decorativo excesivo
fr: Mouvement décoratif excessif
it: Movimento decorativo eccessivo
ru: Чрезмерная декоративная анимация

# about.avoid.spinners
source: Loading spinners
de: Ladebalken
es: Indicadores de carga
fr: Indicateurs de chargement
it: Indicatori di caricamento
ru: Индикаторы загрузки

# about.avoid.subtitle
source: Patterns we consciously reject. Not because they're always wrong, but because they conflict with the experience we're building.
de: Muster, die wir bewusst ablehnen. Nicht weil sie immer falsch sind, sondern weil sie im Widerspruch zu der Erfahrung stehen, die wir aufbauen.
es: Patrones que rechazamos conscientemente. No porque siempre estén mal, sino porque entran en conflicto con la experiencia que estamos construyendo.
fr: Des patterns que nous rejetons consciemment. Non pas parce qu'ils sont toujours mauvais, mais parce qu'ils entrent en conflit avec l'expérience que nous construisons.
it: Pattern che rifiutiamo consapevolmente. Non perché siano sempre sbagliati, ma perché sono in conflitto con l'esperienza che stiamo costruendo.
ru: Паттерны, которые мы сознательно отвергаем. Не потому, что они всегда неправильны, а потому, что они противоречат опыту, который мы создаём.

# about.avoid.title
source: What We Avoid
de: Was Wir Vermeiden
es: Lo Que Evitamos
fr: Ce Que Nous Évitons
it: Cosa Evitiamo
ru: Чего мы избегаем

# about.avoid.tooltip
source: Tooltip dependency
de: Tooltip-Abhängigkeit
es: Dependencia de tooltips
fr: Dépendance aux infobulles
it: Dipendenza dai tooltip
ru: Зависимость от всплывающих подсказок

# about.hero.subtitle
source: We build tools for the long-term web — software that respects the craft of development and the patience of good design.
de: Wir bauen Werkzeuge für das langfristige Web — Software, die das Handwerk der Entwicklung und die Geduld guten Designs respektiert.
es: Construimos herramientas para la web a largo plazo — software que respeta el oficio del desarrollo y la paciencia del buen diseño.
fr: Nous construisons des outils pour le web durable — des logiciels qui respectent l'art du développement et la patience du bon design.
it: Costruiamo strumenti per il web a lungo termine — software che rispetta l'arte dello sviluppo e la pazienza del buon design.
ru: Мы создаём инструменты для долгосрочного веба — программное обеспечение, которое уважает мастерство разработки и терпение хорошего дизайна.

# about.hero.title
source: Our Philosophy
de: Unsere Philosophie
es: Nuestra Filosofía
fr: Notre Philosophie
it: La Nostra Filosofia
ru: Наша философия

# about.principle.composition
source: Composition over inheritance
de: Komposition statt Vererbung
es: Composición sobre herencia
fr: Composition plutôt qu'héritage
it: Composizione invece di ereditarietà
ru: Композиция вместо наследования

# about.principle.composition.desc
source: Build complex behavior from small, predictable parts rather than deep class hierarchies.
de: Komplexes Verhalten aus kleinen, vorhersehbaren Teilen aufbauen statt tiefer Klassenhierarchien.
es: Construye comportamiento complejo a partir de partes pequeñas y predecibles en lugar de jerarquías profundas de clases.
fr: Construisez des comportements complexes à partir de petites parties prévisibles plutôt que de hiérarchies de classes profondes.
it: Costruisci comportamenti complessi da parti piccole e prevedibili invece di gerarchie di classi profonde.
ru: Создавайте сложное поведение из маленьких, предсказуемых частей, а не из глубоких иерархий классов.

# about.principle.convention
source: Convention over configuration
de: Konvention statt Konfiguration
es: Convención sobre configuración
fr: Convention plutôt que configuration
it: Convenzione invece di configurazione
ru: Соглашения вместо конфигурации

# about.principle.convention.desc
source: Sensible defaults that cover 90% of cases. Escape hatches for the rest.
de: Sinnvolle Standardwerte, die 90% der Fälle abdecken. Ausweichmöglichkeiten für den Rest.
es: Valores predeterminados sensatos que cubren el 90% de los casos. Vías de escape para el resto.
fr: Des valeurs par défaut sensées qui couvrent 90% des cas. Des échappatoires pour le reste.
it: Valori predefiniti sensati che coprono il 90% dei casi. Vie d'uscita per il resto.
ru: Разумные значения по умолчанию, покрывающие 90% случаев. Запасные выходы для остального.

# about.principle.durability
source: Durability over novelty
de: Haltbarkeit statt Neuheit
es: Durabilidad sobre novedad
fr: Durabilité plutôt que nouveauté
it: Durabilità invece di novità
ru: Надёжность вместо новизны

# about.principle.durability.desc
source: Choose boring technology that works reliably over shiny tools that may not last.
de: Wählen Sie langweilige Technologie, die zuverlässig funktioniert, statt glänzender Tools, die möglicherweise nicht bestehen.
es: Elige tecnología aburrida que funcione de forma fiable sobre herramientas brillantes que pueden no durar.
fr: Choisissez des technologies éprouvées qui fonctionnent de manière fiable plutôt que des outils brillants qui pourraient ne pas durer.
it: Scegli tecnologie consolidate che funzionano in modo affidabile rispetto a strumenti brillanti che potrebbero non durare.
ru: Выбирайте скучные технологии, которые работают надёжно, вместо блестящих инструментов, которые могут не прижиться.

# about.principle.integration
source: Vertical integration over glue
de: Vertikale Integration statt Klebstoff
es: Integración vertical sobre pegamento
fr: Intégration verticale plutôt que code de liaison
it: Integrazione verticale invece di codice collante
ru: Вертикальная интеграция вместо склейки

# about.principle.integration.desc
source: Own the full stack from source to deployment. Fewer seams, fewer bugs.
de: Den gesamten Stack vom Quellcode bis zur Bereitstellung besitzen. Weniger Nahtstellen, weniger Fehler.
es: Controla todo el stack desde el código fuente hasta el despliegue. Menos uniones, menos errores.
fr: Maîtrisez toute la pile du code source au déploiement. Moins de jointures, moins de bugs.
it: Possiedi l'intero stack dal sorgente al deployment. Meno giunture, meno bug.
ru: Владейте полным стеком от исходного кода до развёртывания. Меньше стыков — меньше ошибок.

# about.principle.static
source: Static analysis over runtime checks
de: Statische Analyse statt Laufzeitprüfungen
es: Análisis estático sobre verificaciones en ejecución
fr: Analyse statique plutôt que vérifications à l'exécution
it: Analisi statica invece di controlli a runtime
ru: Статический анализ вместо проверок во время выполнения

# about.principle.static.desc
source: Catch errors at compile time. Type safety is the first line of defense.
de: Fehler zur Kompilierzeit erkennen. Typsicherheit ist die erste Verteidigungslinie.
es: Detecta errores en tiempo de compilación. La seguridad de tipos es la primera línea de defensa.
fr: Détectez les erreurs à la compilation. La sûreté des types est la première ligne de défense.
it: Cattura gli errori a tempo di compilazione. La sicurezza dei tipi è la prima linea di difesa.
ru: Ловите ошибки на этапе компиляции. Безопасность типов — первая линия обороны.

# about.principle.transparency
source: Transparency over magic
de: Transparenz statt Magie
es: Transparencia sobre magia
fr: Transparence plutôt que magie
it: Trasparenza invece di magia
ru: Прозрачность вместо магии

# about.principle.transparency.desc
source: Every abstraction should be inspectable. No hidden runtime behavior.
de: Jede Abstraktion sollte inspizierbar sein. Kein verstecktes Laufzeitverhalten.
es: Toda abstracción debe ser inspeccionable. Sin comportamiento oculto en tiempo de ejecución.
fr: Chaque abstraction doit être inspectable. Aucun comportement caché à l'exécution.
it: Ogni astrazione dovrebbe essere ispezionabile. Nessun comportamento nascosto a runtime.
ru: Каждая абстракция должна быть инспектируемой. Никакого скрытого поведения во время выполнения.

# about.standard.docs
source: Docs are product
de: Dokumentation ist Produkt
es: La documentación es producto
fr: La documentation est un produit
it: La documentazione è un prodotto
ru: Документация — это продукт

# about.standard.docs.desc
source: Documentation is not an afterthought. It ships with the feature.
de: Dokumentation ist kein Nachgedanke. Sie wird mit dem Feature ausgeliefert.
es: La documentación no es un pensamiento posterior. Se envía con la funcionalidad.
fr: La documentation n'est pas une réflexion après coup. Elle est livrée avec la fonctionnalité.
it: La documentazione non è un ripensamento. Viene rilasciata con la funzionalità.
ru: Документация — не запоздалая мысль. Она поставляется вместе с функцией.

# about.standard.feedback
source: Immediate feedback
de: Sofortiges Feedback
es: Retroalimentación inmediata
fr: Retour immédiat
it: Feedback immediato
ru: Мгновенная обратная связь

# about.standard.feedback.desc
source: Every action should produce a visible result within milliseconds.
de: Jede Aktion sollte innerhalb von Millisekunden ein sichtbares Ergebnis liefern.
es: Cada acción debe producir un resultado visible en milisegundos.
fr: Chaque action doit produire un résultat visible en quelques millisecondes.
it: Ogni azione dovrebbe produrre un risultato visibile entro millisecondi.
ru: Каждое действие должно давать видимый результат в течение миллисекунд.

# about.standard.floor
source: Low floor, high ceiling
de: Niedrige Einstiegshürde, hohe Decke
es: Piso bajo, techo alto
fr: Seuil bas, plafond haut
it: Soglia bassa, soffitto alto
ru: Низкий порог, высокий потолок

# about.standard.floor.desc
source: Easy to start, powerful enough for production. No training wheels that get in the way.
de: Einfach zu starten, leistungsfähig genug für Produktion. Keine Stützräder, die im Weg stehen.
es: Fácil de empezar, lo suficientemente potente para producción. Sin ruedas de entrenamiento que estorben.
fr: Facile à démarrer, assez puissant pour la production. Pas de garde-fous qui gênent.
it: Facile da iniziare, abbastanza potente per la produzione. Nessun limitatore che intralci.
ru: Легко начать, достаточно мощный для продакшена. Никаких ограничителей, которые мешают.

# about.standard.zeroconfig
source: Zero config by default
de: Keine Konfiguration standardmäßig
es: Sin configuración por defecto
fr: Zéro configuration par défaut
it: Zero configurazione di default
ru: Без конфигурации по умолчанию

# about.standard.zeroconfig.desc
source: Ship with sensible defaults. Configuration is for overrides, not setup.
de: Mit sinnvollen Standardwerten ausliefern. Konfiguration ist für Änderungen, nicht für die Einrichtung.
es: Envía con valores predeterminados sensatos. La configuración es para sobreescrituras, no para inicialización.
fr: Livrez avec des valeurs par défaut sensées. La configuration sert aux personnalisations, pas à l'installation.
it: Distribuisci con valori predefiniti sensati. La configurazione è per le personalizzazioni, non per il setup.
ru: Поставляйте с разумными значениями по умолчанию. Конфигурация — для переопределений, не для настройки.

# about.standards.subtitle
source: How we think about the experience layer — the interface between tool and human.
de: Wie wir über die Erfahrungsebene denken — die Schnittstelle zwischen Werkzeug und Mensch.
es: Cómo pensamos sobre la capa de experiencia — la interfaz entre herramienta y humano.
fr: Comment nous pensons la couche d'expérience — l'interface entre l'outil et l'humain.
it: Come pensiamo al livello dell'esperienza — l'interfaccia tra strumento e persona.
ru: Как мы думаем о слое опыта — интерфейсе между инструментом и человеком.

# about.standards.title
source: Product Standards
de: Produktstandards
es: Estándares de Producto
fr: Standards Produit
it: Standard di Prodotto
ru: Стандарты продукта

# about.thesis.subtitle
source: Six principles that guide every architectural decision we make.
de: Sechs Prinzipien, die jede architektonische Entscheidung leiten.
es: Seis principios que guían cada decisión arquitectónica que tomamos.
fr: Six principes qui guident chacune de nos décisions architecturales.
it: Sei principi che guidano ogni nostra decisione architetturale.
ru: Шесть принципов, которые направляют каждое наше архитектурное решение.

# about.thesis.title
source: Systems Thesis
de: Systemthese
es: Tesis de Sistemas
fr: Thèse Système
it: Tesi di Sistema
ru: Системный тезис

# blog.subtitle
source: Architectural notes, design decisions, and build updates.
de: Architekturnotizen, Designentscheidungen und Build-Updates.
es: Notas arquitectónicas, decisiones de diseño y actualizaciones de construcción.
fr: Notes architecturales, décisions de design et mises à jour de développement.
it: Note architetturali, decisioni di design e aggiornamenti sullo sviluppo.
ru: Архитектурные заметки, дизайн-решения и обновления сборки.

# composer.capabilities
source: Visual-First Onboarding · Single-Worker Model · Deterministic Builds via Stage
de: Visual-First Onboarding · Single-Worker-Modell · Deterministische Builds via Stage
es: Incorporación Visual · Modelo de Trabajador Único · Compilaciones Determinísticas via Stage
fr: Onboarding visuel · Modèle à worker unique · Builds déterministes via Stage
it: Onboarding visuale · Modello a singolo worker · Build deterministiche via Stage
ru: Визуальный онбординг · Модель одного воркера · Детерминированные сборки через Stage

# composer.description
source: A native visual editor for macOS and iPad that lets you design and build Score projects without writing code. Drag-and-drop components, live preview, and deterministic production builds powered by Stage. Coming soon.
de: Ein nativer visueller Editor für macOS und iPad, mit dem Sie Score-Projekte ohne Code entwerfen und erstellen können. Drag-and-Drop-Komponenten, Live-Vorschau und deterministische Produktions-Builds powered by Stage. Demnächst.
es: Un editor visual nativo para macOS e iPad que te permite diseñar y construir proyectos Score sin escribir código. Componentes de arrastrar y soltar, vista previa en vivo y compilaciones de producción determinísticas impulsadas por Stage. Próximamente.
fr: Un éditeur visuel natif pour macOS et iPad qui vous permet de concevoir et construire des projets Score sans écrire de code. Glisser-déposer des composants, aperçu en direct et builds de production déterministes via Stage. Bientôt disponible.
it: Un editor visuale nativo per macOS e iPad che ti permette di progettare e costruire progetti Score senza scrivere codice. Componenti drag-and-drop, anteprima live e build di produzione deterministiche con Stage. In arrivo.
ru: Нативный визуальный редактор для macOS и iPad, который позволяет проектировать и создавать проекты Score без написания кода. Перетаскивание компонентов, живой предпросмотр и детерминированные продакшен-сборки на базе Stage. Скоро.

# composer.feature.canvas
source: Visual Canvas Editor
de: Visueller Canvas-Editor
es: Editor de Lienzo Visual
fr: Éditeur Canvas Visuel
it: Editor Canvas Visuale
ru: Визуальный редактор холста

# composer.feature.canvas.desc
source: Design layouts with a native macOS and iPad drag-and-drop editor. Build visually, export cleanly.
de: Layouts mit einem nativen Drag-and-Drop-Editor für macOS und iPad gestalten. Visuell bauen, sauber exportieren.
es: Diseña maquetaciones con un editor nativo de arrastrar y soltar para macOS e iPad. Construye visualmente, exporta limpiamente.
fr: Concevez des mises en page avec un éditeur glisser-déposer natif macOS et iPad. Construisez visuellement, exportez proprement.
it: Progetta layout con un editor drag-and-drop nativo per macOS e iPad. Costruisci visivamente, esporta in modo pulito.
ru: Проектируйте макеты с помощью нативного редактора macOS и iPad с перетаскиванием. Создавайте визуально, экспортируйте чисто.

# composer.feature.library
source: Component Library
de: Komponentenbibliothek
es: Biblioteca de Componentes
fr: Bibliothèque de Composants
it: Libreria Componenti
ru: Библиотека компонентов

# composer.feature.library.desc
source: Reusable building blocks that sync with your Score project. Compose once, use everywhere.
de: Wiederverwendbare Bausteine, die mit Ihrem Score-Projekt synchronisiert werden. Einmal zusammenstellen, überall verwenden.
es: Bloques de construcción reutilizables que se sincronizan con tu proyecto Score. Compone una vez, usa en todas partes.
fr: Des blocs réutilisables synchronisés avec votre projet Score. Composez une fois, utilisez partout.
it: Blocchi riutilizzabili sincronizzati con il tuo progetto Score. Componi una volta, usa ovunque.
ru: Переиспользуемые строительные блоки, синхронизированные с вашим проектом Score. Создайте один раз — используйте везде.

# composer.feature.preview
source: Live Preview
de: Live-Vorschau
es: Vista Previa en Vivo
fr: Aperçu en Direct
it: Anteprima Live
ru: Живой предпросмотр

# composer.feature.preview.desc
source: See changes rendered in real-time as you build. What you see is what ships to production.
de: Sehen Sie Änderungen in Echtzeit gerendert, während Sie bauen. Was Sie sehen, geht in Produktion.
es: Ve los cambios renderizados en tiempo real mientras construyes. Lo que ves es lo que se publica en producción.
fr: Voyez les changements rendus en temps réel pendant que vous construisez. Ce que vous voyez est ce qui part en production.
it: Vedi le modifiche renderizzate in tempo reale mentre costruisci. Quello che vedi è quello che va in produzione.
ru: Смотрите изменения в реальном времени, пока вы создаёте. Что видите — то и отправляется в продакшен.

# composer.headline
source: The Visual Editor for macOS and iPad
de: Der Visuelle Editor für macOS und iPad
es: El Editor Visual para macOS e iPad
fr: L'Éditeur Visuel pour macOS et iPad
it: L'Editor Visuale per macOS e iPad
ru: Визуальный редактор для macOS и iPad

# composer.meta_desc
source: The native macOS and iPad visual editor
de: Der native visuelle Editor für macOS und iPad
es: El editor visual nativo para macOS e iPad
fr: L'éditeur visuel natif pour macOS et iPad
it: L'editor visuale nativo per macOS e iPad
ru: Нативный визуальный редактор для macOS и iPad

# counter.increment
source: Increment
de: Erhöhen
es: Incrementar
fr: Incrémenter
it: Incrementa
ru: Увеличить

# counter.label
source: Count:
de: Zähler:
es: Cuenta:
fr: Compteur :
it: Conteggio:
ru: Счётчик:

# docs.composer.coming_soon_desc
source: Composer documentation is currently being written. Check back soon for guides on the visual editor, canvas workflows, and component library.
de: Die Composer-Dokumentation wird derzeit geschrieben. Schauen Sie bald wieder vorbei für Anleitungen zum visuellen Editor, Canvas-Workflows und Komponentenbibliothek.
es: La documentación de Composer se está escribiendo actualmente. Vuelve pronto para guías sobre el editor visual, flujos de lienzo y biblioteca de componentes.
fr: La documentation de Composer est en cours de rédaction. Revenez bientôt pour des guides sur l'éditeur visuel, les workflows du canvas et la bibliothèque de composants.
it: La documentazione di Composer è in fase di scrittura. Torna presto per guide sull'editor visuale, i flussi di lavoro del canvas e la libreria componenti.
ru: Документация Composer находится в процессе написания. Скоро здесь появятся руководства по визуальному редактору, рабочим процессам холста и библиотеке компонентов.

# docs.composer.desc
source: Native visual editor and GUI workflows.
de: Nativer visueller Editor und GUI-Workflows.
es: Editor visual nativo y flujos de trabajo GUI.
fr: Éditeur visuel natif et workflows GUI.
it: Editor visuale nativo e workflow GUI.
ru: Нативный визуальный редактор и GUI-процессы.

# docs.composer.product_link
source: Composer product page →
de: Composer-Produktseite →
es: Página del producto Composer →
fr: Page produit Composer →
it: Pagina prodotto Composer →
ru: Страница продукта Composer →

# docs.composer.title
source: Composer Documentation
de: Composer-Dokumentation
es: Documentación de Composer
fr: Documentation Composer
it: Documentazione Composer
ru: Документация Composer

# docs.libretto.note
source: Libretto has no standalone documentation — it is documented through Score and Stage.
de: Libretto hat keine eigenständige Dokumentation — es wird durch Score und Stage dokumentiert.
es: Libretto no tiene documentación independiente — está documentado a través de Score y Stage.
fr: Libretto n'a pas de documentation séparée — il est documenté via Score et Stage.
it: Libretto non ha documentazione separata — è documentato tramite Score e Stage.
ru: У Libretto нет отдельной документации — он документирован через Score и Stage.

# docs.score.desc
source: Framework, runtime model, components, CLI, and build artifacts.
de: Framework, Laufzeitmodell, Komponenten, CLI und Build-Artefakte.
es: Framework, modelo de ejecución, componentes, CLI y artefactos de compilación.
fr: Framework, modèle d'exécution, composants, CLI et artefacts de build.
it: Framework, modello di runtime, componenti, CLI e artefatti di build.
ru: Фреймворк, модель выполнения, компоненты, CLI и артефакты сборки.

# docs.stage.coming_soon_desc
source: Stage documentation is currently being written. Check back soon for guides on deployment, hosting, and observability.
de: Die Stage-Dokumentation wird derzeit geschrieben. Schauen Sie bald wieder vorbei für Anleitungen zu Bereitstellung, Hosting und Observability.
es: La documentación de Stage se está escribiendo actualmente. Vuelve pronto para guías sobre despliegue, alojamiento y observabilidad.
fr: La documentation de Stage est en cours de rédaction. Revenez bientôt pour des guides sur le déploiement, l'hébergement et l'observabilité.
it: La documentazione di Stage è in fase di scrittura. Torna presto per guide su deployment, hosting e osservabilità.
ru: Документация Stage находится в процессе написания. Скоро здесь появятся руководства по развёртыванию, хостингу и наблюдаемости.

# docs.stage.desc
source: Hosting, deployment, and observability.
de: Hosting, Bereitstellung und Observability.
es: Alojamiento, despliegue y observabilidad.
fr: Hébergement, déploiement et observabilité.
it: Hosting, deployment e osservabilità.
ru: Хостинг, развёртывание и наблюдаемость.

# docs.stage.product_link
source: Stage product page →
de: Stage-Produktseite →
es: Página del producto Stage →
fr: Page produit Stage →
it: Pagina prodotto Stage →
ru: Страница продукта Stage →

# docs.stage.title
source: Stage Documentation
de: Stage-Dokumentation
es: Documentación de Stage
fr: Documentation Stage
it: Documentazione Stage
ru: Документация Stage

# docs.subtitle
source: Everything you need to build with the Allegro ecosystem
de: Alles, was Sie zum Bauen mit dem Allegro-Ökosystem brauchen
es: Todo lo que necesitas para construir con el ecosistema Allegro
fr: Tout ce dont vous avez besoin pour construire avec l'écosystème Allegro
it: Tutto ciò che serve per costruire con l'ecosistema Allegro
ru: Всё, что нужно для работы с экосистемой Allegro

# docs.title
source: Documentation
de: Dokumentation
es: Documentación
it: Documentazione
ru: Документация
